---
kind: method
id: M:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.Dispose
source: html/d57ea5ef-9825-70d4-fde3-0f29fbcedf32.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.Dispose Method

Releases all resources used by the BendingDetailCustomFieldProperties

## Syntax (C#)
```csharp
public void Dispose()
```